{
  "irVersion": "1.0",
  "project": "graphfs",
  "repository": "https://github.com/plexusone/graphfs",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-04-09",
      "highlights": [
        { "description": "Git-friendly graph database with one-file-per-entity storage for minimal diffs" },
        { "description": "Edge confidence system supporting EXTRACTED, INFERRED, and AMBIGUOUS relationships" }
      ],
      "added": [
        { "description": "`graph.Node` type with ID, Type, Label, and extensible Attrs map" },
        { "description": "`graph.Edge` type with From, To, Type, Confidence, ConfidenceScore, and Attrs" },
        { "description": "`graph.Graph` type with in-memory node/edge collections and CRUD operations" },
        { "description": "`graph.Confidence` enum: EXTRACTED (AST-derived), INFERRED (LLM), AMBIGUOUS (uncertain)" },
        { "description": "Edge type constants: calls, imports, implements, extends, uses, contains, depends_on, references" },
        { "description": "`store.FSStore` for filesystem-backed persistence with `nodes/` and `edges/` directories" },
        { "description": "`store.Store` interface for pluggable storage backends" },
        { "description": "One-file-per-entity storage: `nodes/{id}.json` and `edges/{from}--{type}-->{to}.json`" },
        { "description": "`format.MarshalCanonical` and `UnmarshalCanonical` for deterministic JSON output" },
        { "description": "Graph operations: `SaveGraph`, `ListNodes`, `ListEdges`, `GetNode`, `GetEdge`" },
        { "description": "`schema.Validate` for validating graph structure" }
      ]
    }
  ]
}
