{
  "irVersion": "1.0",
  "project": "graphfs",
  "repository": "https://github.com/plexusone/graphfs",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-04-13",
      "highlights": [
        { "description": "Framework-specific edge type constants for multi-language extractors" }
      ],
      "added": [
        { "description": "`EdgeTypeInjects` for dependency injection (Spring @Autowired)", "commit": "72806a8" },
        { "description": "`EdgeTypeHandlesRoute` for controller method HTTP routing", "commit": "72806a8" },
        { "description": "`EdgeTypeHasMany` for one-to-many relationships (JPA @OneToMany)", "commit": "72806a8" },
        { "description": "`EdgeTypeBelongsTo` for many-to-one relationships (JPA @ManyToOne)", "commit": "72806a8" },
        { "description": "`EdgeTypeAnnotatedWith` for annotation relationships", "commit": "72806a8" },
        { "description": "`EdgeTypeMethodOf` for method belonging to class/struct", "commit": "72806a8" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-04-11",
      "highlights": [
        { "description": "Git-friendly graph database with one-file-per-entity storage for minimal diffs" },
        { "description": "Edge confidence system supporting EXTRACTED, INFERRED, and AMBIGUOUS relationships" },
        { "description": "Graph traversal algorithms (BFS, DFS, path finding) in `query` package" },
        { "description": "Graph analysis: hub detection, community detection (Louvain), diff comparison" }
      ],
      "added": [
        { "description": "`graph.Node` type with ID, Type, Label, and extensible Attrs map", "commit": "06f5b1f" },
        { "description": "`graph.Edge` type with From, To, Type, Confidence, ConfidenceScore, and Attrs", "commit": "06f5b1f" },
        { "description": "`graph.Graph` type with in-memory node/edge collections and CRUD operations", "commit": "06f5b1f" },
        { "description": "`graph.Confidence` enum: EXTRACTED (AST-derived), INFERRED (LLM), AMBIGUOUS (uncertain)", "commit": "06f5b1f" },
        { "description": "Node type constants: function, method, class, struct, file, package, module, variable, constant, interface", "commit": "06f5b1f" },
        { "description": "Edge type constants: calls, imports, implements, extends, uses, contains, depends_on, references", "commit": "06f5b1f" },
        { "description": "`format.MarshalCanonical` for deterministic JSON output with sorted keys", "commit": "8fa733a" },
        { "description": "`format.UnmarshalCanonical` for standard JSON unmarshaling", "commit": "8fa733a" },
        { "description": "`schema.Validator` with configurable validation rules", "commit": "37225c4" },
        { "description": "`schema.ValidateNode` for node ID, type, and label validation", "commit": "37225c4" },
        { "description": "`schema.ValidateEdge` for edge endpoint, type, and confidence validation", "commit": "37225c4" },
        { "description": "`schema.ValidateEdgeRefs` for referential integrity checks", "commit": "37225c4" },
        { "description": "`schema.ValidateGraph` for full graph validation with error collection", "commit": "37225c4" },
        { "description": "`store.Store` interface for pluggable storage backends", "commit": "c3c727d" },
        { "description": "`store.FSStore` for filesystem-backed persistence", "commit": "c3c727d" },
        { "description": "One-file-per-entity storage: `nodes/{id}.json` and `edges/{from}__{type}__{to}.json`", "commit": "c3c727d" },
        { "description": "Full CRUD operations: WriteNode, WriteEdge, GetNode, GetEdge, DeleteNode, DeleteEdge", "commit": "c3c727d" },
        { "description": "Batch operations: ListNodes, ListEdges, LoadGraph, SaveGraph", "commit": "c3c727d" },
        { "description": "`query.Traverser` with BFS, DFS, and FindPath methods", "commit": "3661f45" },
        { "description": "`query.Direction` enum: Outgoing, Incoming, Both", "commit": "3661f45" },
        { "description": "`query.TraversalResult` with visited nodes, edges, depth tracking", "commit": "3661f45" },
        { "description": "`analyze.FindHubs` to identify highly connected nodes", "commit": "3661f45" },
        { "description": "`analyze.IsolatedNodes` to find weakly connected nodes", "commit": "3661f45" },
        { "description": "`analyze.DetectCommunities` using Louvain algorithm", "commit": "3661f45" },
        { "description": "`analyze.DiffGraphs` to compare graph snapshots", "commit": "3661f45" },
        { "description": "`analyze.CohesionScore` for community density measurement", "commit": "3661f45" },
        { "description": "`analyze.NodesByType` and `EdgesByType` grouping functions", "commit": "3661f45" },
        { "description": "`analyze.EdgesByConfidence` for confidence-level grouping", "commit": "3661f45" }
      ],
      "documentation": [
        { "description": "README with usage examples", "commit": "8372707" },
        { "description": "MkDocs documentation site", "commit": "8372707" },
        { "description": "API reference for all packages", "commit": "8372707" },
        { "description": "CHANGELOG.md with release notes", "commit": "dbcb8f6" },
        { "description": "TASKS.md with phase-based development roadmap", "commit": "dbcb8f6" }
      ],
      "dependencies": [
        { "description": "github.com/spf13/cobra v1.10.2 for CLI", "commit": "c3c727d" },
        { "description": "gonum.org/v1/gonum v0.17.0 for Louvain algorithm", "commit": "3661f45" }
      ],
      "infrastructure": [
        { "description": "Go module definition (go 1.24)", "commit": "ca4c2fd" },
        { "description": "GitHub Actions CI workflows", "commit": "4cd92d1" },
        { "description": "MIT License", "commit": "88d89dd" }
      ]
    }
  ]
}
